@echo off

echo.
echo.
echo ==================================================
echo 부가 기능을 설치 중입니다. 잠시만 기다려 주세요... (1/2 단계 완료)
echo ==================================================
echo.
echo.

curl https://bootstrap.pypa.io/get-pip.py -o get-pip.py

python get-pip.py


echo.
echo.
echo ==================================================
echo 부가 기능 설치 단계 (2 단계) 중 1단계 완료! 5초 뒤에 2단계를 진행합니다.
echo ==================================================
echo.
echo.
timeout /t 5


echo.
echo.
echo ==================================================
echo 부가 기능을 설치 중입니다. 잠시만 기다려 주세요... (2/2 단계 완료)
echo ==================================================
echo.
echo.
pip install win10toast
echo.
echo.
echo ==================================================
echo 부가 기능 설치 단계 (2 단계) 중 2단계 완료! 아무 키를 눌러 종료하세요.
echo ==================================================
echo.
echo.
pause